z-mnp-test/temp.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
	<soap:Body>
		<ns:processNPCMsg xmlns:ns="http://ws.clearinghouse.com">
			<ns:userId>catToClh</ns:userId>
			<ns:password>Y2F0VG9DbGg=</ns:password>
			<ns:xmlMsg><?xml version="1.0" encoding="UTF-8" standalone="yes"?>
				<NPCMessageData>
					<NPCData>
						<MessageHeader>
							<PortType>1</PortType>
							<MessageID>3001</MessageID>
							<SoapRequestId>132</SoapRequestId>
							<MessageCreateTimeStamp>20180217210846</MessageCreateTimeStamp>
							<Sender>CAT3G</Sender>
							<Receiver>CRDBINT</Receiver>
						</MessageHeader>
						<NPCMessages>
							<NumberReturn>
								<OrderId>021801211131722</OrderId>
								<NumberNoPortId>
									<MSISDN>0896966694</MSISDN>
								</NumberNoPortId>
								<NumberNoPortId>
									<MSISDN>0857280531</MSISDN>
								</NumberNoPortId>
								<NumberNoPortId>
									<MSISDN>0838016600</MSISDN>
								</NumberNoPortId>
								<NumberNoPortId>
									<MSISDN>0874488988</MSISDN>
								</NumberNoPortId>
								<NumberNoPortId>
									<MSISDN>0869990900</MSISDN>
								</NumberNoPortId>
								<NumberNoPortId>
									<MSISDN>0867802088</MSISDN>
								</NumberNoPortId>
								<NumberNoPortId>
									<MSISDN>0895955522</MSISDN>
								</NumberNoPortId>
								<NumberNoPortId>
									<MSISDN>0897978508</MSISDN>
								</NumberNoPortId>
								<NumberNoPortId>
									<MSISDN>0847520001</MSISDN>
								</NumberNoPortId>
								<NumberNoPortId>
									<MSISDN>0838355522</MSISDN>
								</NumberNoPortId>
								<NumberNoPortId>
									<MSISDN>0804299660</MSISDN>
								</NumberNoPortId>
								<NumberNoPortId>
									<MSISDN>0818405384</MSISDN>
								</NumberNoPortId>
								<NumberNoPortId>
									<MSISDN>0866333880</MSISDN>
								</NumberNoPortId>
								<NumberNoPortId>
									<MSISDN>0811718196</MSISDN>
								</NumberNoPortId>
								<NumberNoPortId>
									<MSISDN>0818874778</MSISDN>
								</NumberNoPortId>
								<NumberNoPortId>
									<MSISDN>0898134662</MSISDN>
								</NumberNoPortId>
								<NumberNoPortId>
									<MSISDN>0811319555</MSISDN>
								</NumberNoPortId>
								<NumberNoPortId>
									<MSISDN>0837598777</MSISDN>
								</NumberNoPortId>
								<NumberNoPortId>
									<MSISDN>0814885161</MSISDN>
								</NumberNoPortId>
								<NumberNoPortId>
									<MSISDN>0870585575</MSISDN>
								</NumberNoPortId>
								<NumberNoPortId>
									<MSISDN>0832725678</MSISDN>
								</NumberNoPortId>
								<NumberNoPortId>
									<MSISDN>0896533007</MSISDN>
								</NumberNoPortId>
								<NumberNoPortId>
									<MSISDN>0892663033</MSISDN>
								</NumberNoPortId>
								<NumberNoPortId>
									<MSISDN>0868701542</MSISDN>
								</NumberNoPortId>
								<NumberNoPortId>
									<MSISDN>0818820148</MSISDN>
								</NumberNoPortId>
								<NumberNoPortId>
									<MSISDN>0850363383</MSISDN>
								</NumberNoPortId>
								<NumberNoPortId>
									<MSISDN>0817157735</MSISDN>
								</NumberNoPortId>
								<NumberNoPortId>
									<MSISDN>0814900800</MSISDN>
								</NumberNoPortId>
								<NumberNoPortId>
									<MSISDN>0865138001</MSISDN>
								</NumberNoPortId>
								<NumberNoPortId>
									<MSISDN>0894331015</MSISDN>
								</NumberNoPortId>
								<NumberNoPortId>
									<MSISDN>0851078348</MSISDN>
								</NumberNoPortId>
								<NumberNoPortId>
									<MSISDN>0899996146</MSISDN>
								</NumberNoPortId>
								<NumberNoPortId>
									<MSISDN>0846131371</MSISDN>
								</NumberNoPortId>
								<NumberNoPortId>
									<MSISDN>0819347985</MSISDN>
								</NumberNoPortId>
								<NumberNoPortId>
									<MSISDN>0877952305</MSISDN>
								</NumberNoPortId>
								<NumberNoPortId>
									<MSISDN>0849298768</MSISDN>
								</NumberNoPortId>
								<NumberNoPortId>
									<MSISDN>0857425522</MSISDN>
								</NumberNoPortId>
								<NumberNoPortId>
									<MSISDN>0804040009</MSISDN>
								</NumberNoPortId>
								<NumberNoPortId>
									<MSISDN>0848849217</MSISDN>
								</NumberNoPortId>
								<NumberNoPortId>
									<MSISDN>0877139157</MSISDN>
								</NumberNoPortId>
								<NumberNoPortId>
									<MSISDN>0851494847</MSISDN>
								</NumberNoPortId>
								<NumberNoPortId>
									<MSISDN>0891837292</MSISDN>
								</NumberNoPortId>
								<NumberNoPortId>
									<MSISDN>0816725281</MSISDN>
								</NumberNoPortId>
								<NumberNoPortId>
									<MSISDN>0905644559</MSISDN>
								</NumberNoPortId>
								<NumberNoPortId>
									<MSISDN>0817388173</MSISDN>
								</NumberNoPortId>
								<NumberNoPortId>
									<MSISDN>0840487580</MSISDN>
								</NumberNoPortId>
								<NumberNoPortId>
									<MSISDN>0818551898</MSISDN>
								</NumberNoPortId>
								<NumberNoPortId>
									<MSISDN>0849015065</MSISDN>
								</NumberNoPortId>
								<NumberNoPortId>
									<MSISDN>0911288891</MSISDN>
								</NumberNoPortId>
								<NumberNoPortId>
									<MSISDN>0814254695</MSISDN>
								</NumberNoPortId>
								<NumberNoPortId>
									<MSISDN>0840402040</MSISDN>
								</NumberNoPortId>
								<NumberNoPortId>
									<MSISDN>0812568103</MSISDN>
								</NumberNoPortId>
								<NumberNoPortId>
									<MSISDN>0898460010</MSISDN>
								</NumberNoPortId>
								<NumberNoPortId>
									<MSISDN>0810618880</MSISDN>
								</NumberNoPortId>
								<NumberNoPortId>
									<MSISDN>0898709048</MSISDN>
								</NumberNoPortId>
								<NumberNoPortId>
									<MSISDN>0816989994</MSISDN>
								</NumberNoPortId>
								<NumberNoPortId>
									<MSISDN>0870591749</MSISDN>
								</NumberNoPortId>
								<NumberNoPortId>
									<MSISDN>0897551525</MSISDN>
								</NumberNoPortId>
								<NumberNoPortId>
									<MSISDN>0818621910</MSISDN>
								</NumberNoPortId>
								<NumberNoPortId>
									<MSISDN>0812702623</MSISDN>
								</NumberNoPortId>
								<NumberNoPortId>
									<MSISDN>0904757589</MSISDN>
								</NumberNoPortId>
								<NumberNoPortId>
									<MSISDN>0819621186</MSISDN>
								</NumberNoPortId>
								<NumberNoPortId>
									<MSISDN>0851635520</MSISDN>
								</NumberNoPortId>
								<NumberNoPortId>
									<MSISDN>0839437744</MSISDN>
								</NumberNoPortId>
								<NumberNoPortId>
									<MSISDN>0850671220</MSISDN>
								</NumberNoPortId>
								<NumberNoPortId>
									<MSISDN>0877751961</MSISDN>
								</NumberNoPortId>
								<NumberNoPortId>
									<MSISDN>0888830230</MSISDN>
								</NumberNoPortId>
								<NumberNoPortId>
									<MSISDN>0837065634</MSISDN>
								</NumberNoPortId>
								<NumberNoPortId>
									<MSISDN>0876616446</MSISDN>
								</NumberNoPortId>
								<NumberNoPortId>
									<MSISDN>0905235499</MSISDN>
								</NumberNoPortId>
								<NumberNoPortId>
									<MSISDN>0901632577</MSISDN>
								</NumberNoPortId>
								<NumberNoPortId>
									<MSISDN>0844559080</MSISDN>
								</NumberNoPortId>
								<NumberNoPortId>
									<MSISDN>0841607000</MSISDN>
								</NumberNoPortId>
								<NumberNoPortId>
									<MSISDN>0807548344</MSISDN>
								</NumberNoPortId>
								<NumberNoPortId>
									<MSISDN>0859111635</MSISDN>
								</NumberNoPortId>
								<NumberNoPortId>
									<MSISDN>0899555603</MSISDN>
								</NumberNoPortId>
								<NumberNoPortId>
									<MSISDN>0811603030</MSISDN>
								</NumberNoPortId>
								<NumberNoPortId>
									<MSISDN>0876468484</MSISDN>
								</NumberNoPortId>
								<NumberNoPortId>
									<MSISDN>0890246090</MSISDN>
								</NumberNoPortId>
								<NumberNoPortId>
									<MSISDN>0879996095</MSISDN>
								</NumberNoPortId>
								<NumberNoPortId>
									<MSISDN>0828351679</MSISDN>
								</NumberNoPortId>
								<NumberNoPortId>
									<MSISDN>0808088058</MSISDN>
								</NumberNoPortId>
								<NumberNoPortId>
									<MSISDN>0819388139</MSISDN>
								</NumberNoPortId>
								<NumberNoPortId>
									<MSISDN>0859094002</MSISDN>
								</NumberNoPortId>
								<NumberNoPortId>
									<MSISDN>0815452255</MSISDN>
								</NumberNoPortId>
								<NumberNoPortId>
									<MSISDN>0843852000</MSISDN>
								</NumberNoPortId>
								<NumberNoPortId>
									<MSISDN>0853295050</MSISDN>
								</NumberNoPortId>
								<NumberNoPortId>
									<MSISDN>0819669321</MSISDN>
								</NumberNoPortId>
								<NumberNoPortId>
									<MSISDN>0856430950</MSISDN>
								</NumberNoPortId>
								<NumberNoPortId>
									<MSISDN>0868917195</MSISDN>
								</NumberNoPortId>
								<NumberNoPortId>
									<MSISDN>0816464833</MSISDN>
								</NumberNoPortId>
								<NumberNoPortId>
									<MSISDN>0813208700</MSISDN>
								</NumberNoPortId>
								<NumberNoPortId>
									<MSISDN>0852879898</MSISDN>
								</NumberNoPortId>
								<NumberNoPortId>
									<MSISDN>0871033392</MSISDN>
								</NumberNoPortId>
								<NumberNoPortId>
									<MSISDN>0808184383</MSISDN>
								</NumberNoPortId>
								<NumberNoPortId>
									<MSISDN>0847600896</MSISDN>
								</NumberNoPortId>
								<NumberNoPortId>
									<MSISDN>0818938600</MSISDN>
								</NumberNoPortId>
								<NumberNoPortId>
									<MSISDN>0859120753</MSISDN>
								</NumberNoPortId>
								<NumberNoPortId>
									<MSISDN>0816812210</MSISDN>
								</NumberNoPortId>
								<NumberNoPortId>
									<MSISDN>0878527250</MSISDN>
								</NumberNoPortId>
								<NumberNoPortId>
									<MSISDN>0815569426</MSISDN>
								</NumberNoPortId>
								<NumberNoPortId>
									<MSISDN>0852282426</MSISDN>
								</NumberNoPortId>
								<NumberNoPortId>
									<MSISDN>0817780808</MSISDN>
								</NumberNoPortId>
								<NumberNoPortId>
									<MSISDN>0871708533</MSISDN>
								</NumberNoPortId>
								<NumberNoPortId>
									<MSISDN>0817876658</MSISDN>
								</NumberNoPortId>
								<NumberNoPortId>
									<MSISDN>0843556614</MSISDN>
								</NumberNoPortId>
								<NumberNoPortId>
									<MSISDN>0801719280</MSISDN>
								</NumberNoPortId>
								<NumberNoPortId>
									<MSISDN>0811408825</MSISDN>
								</NumberNoPortId>
								<NumberNoPortId>
									<MSISDN>0914969699</MSISDN>
								</NumberNoPortId>
								<NumberNoPortId>
									<MSISDN>0818799399</MSISDN>
								</NumberNoPortId>
								<NumberNoPortId>
									<MSISDN>0870184942</MSISDN>
								</NumberNoPortId>
								<NumberNoPortId>
									<MSISDN>0831662442</MSISDN>
								</NumberNoPortId>
								<NumberNoPortId>
									<MSISDN>0862399825</MSISDN>
								</NumberNoPortId>
								<NumberNoPortId>
									<MSISDN>0873857596</MSISDN>
								</NumberNoPortId>
								<NumberNoPortId>
									<MSISDN>0850858282</MSISDN>
								</NumberNoPortId>
								<NumberNoPortId>
									<MSISDN>0849394597</MSISDN>
								</NumberNoPortId>
								<NumberNoPortId>
									<MSISDN>0899694076</MSISDN>
								</NumberNoPortId>
								<NumberNoPortId>
									<MSISDN>0961939145</MSISDN>
								</NumberNoPortId>
								<NumberNoPortId>
									<MSISDN>0906691583</MSISDN>
								</NumberNoPortId>
								<NumberNoPortId>
									<MSISDN>0905103390</MSISDN>
								</NumberNoPortId>
								<NumberNoPortId>
									<MSISDN>0862047155</MSISDN>
								</NumberNoPortId>
								<NumberNoPortId>
									<MSISDN>0856360376</MSISDN>
								</NumberNoPortId>
								<NumberNoPortId>
									<MSISDN>0897515959</MSISDN>
								</NumberNoPortId>
								<NumberNoPortId>
									<MSISDN>0838516504</MSISDN>
								</NumberNoPortId>
								<NumberNoPortId>
									<MSISDN>0926022789</MSISDN>
								</NumberNoPortId>
								<NumberNoPortId>
									<MSISDN>0847337772</MSISDN>
								</NumberNoPortId>
								<NumberNoPortId>
									<MSISDN>0818553321</MSISDN>
								</NumberNoPortId>
								<NumberNoPortId>
									<MSISDN>0924476611</MSISDN>
								</NumberNoPortId>
								<NumberNoPortId>
									<MSISDN>0925795280</MSISDN>
								</NumberNoPortId>
								<NumberNoPortId>
									<MSISDN>0818159077</MSISDN>
								</NumberNoPortId>
								<NumberNoPortId>
									<MSISDN>0871846571</MSISDN>
								</NumberNoPortId>
								<NumberNoPortId>
									<MSISDN>0818574709</MSISDN>
								</NumberNoPortId>
								<NumberNoPortId>
									<MSISDN>0895015596</MSISDN>
								</NumberNoPortId>
								<NumberNoPortId>
									<MSISDN>0867896791</MSISDN>
								</NumberNoPortId>
								<NumberNoPortId>
									<MSISDN>0963692463</MSISDN>
								</NumberNoPortId>
								<NumberNoPortId>
									<MSISDN>0806848181</MSISDN>
								</NumberNoPortId>
								<NumberNoPortId>
									<MSISDN>0818449607</MSISDN>
								</NumberNoPortId>
								<NumberNoPortId>
									<MSISDN>0939829968</MSISDN>
								</NumberNoPortId>
								<NumberNoPortId>
									<MSISDN>0899621582</MSISDN>
								</NumberNoPortId>
								<NumberNoPortId>
									<MSISDN>0834739935</MSISDN>
								</NumberNoPortId>
								<NumberNoPortId>
									<MSISDN>0869623872</MSISDN>
								</NumberNoPortId>
								<NumberNoPortId>
									<MSISDN>0860902662</MSISDN>
								</NumberNoPortId>
								<NumberNoPortId>
									<MSISDN>0897720585</MSISDN>
								</NumberNoPortId>
								<NumberNoPortId>
									<MSISDN>0890057727</MSISDN>
								</NumberNoPortId>
								<NumberNoPortId>
									<MSISDN>0819573848</MSISDN>
								</NumberNoPortId>
								<NumberNoPortId>
									<MSISDN>0895760845</MSISDN>
								</NumberNoPortId>
								<NumberNoPortId>
									<MSISDN>0890258818</MSISDN>
								</NumberNoPortId>
								<NumberNoPortId>
									<MSISDN>0807234722</MSISDN>
								</NumberNoPortId>
								<NumberNoPortId>
									<MSISDN>0937265749</MSISDN>
								</NumberNoPortId>
								<NumberNoPortId>
									<MSISDN>0850294360</MSISDN>
								</NumberNoPortId>
								<NumberNoPortId>
									<MSISDN>0872221118</MSISDN>
								</NumberNoPortId>
								<NumberNoPortId>
									<MSISDN>0875781493</MSISDN>
								</NumberNoPortId>
								<NumberNoPortId>
									<MSISDN>0875779996</MSISDN>
								</NumberNoPortId>
								<NumberNoPortId>
									<MSISDN>0891155377</MSISDN>
								</NumberNoPortId>
								<NumberNoPortId>
									<MSISDN>0816953945</MSISDN>
								</NumberNoPortId>
								<NumberNoPortId>
									<MSISDN>0856013136</MSISDN>
								</NumberNoPortId>
								<NumberNoPortId>
									<MSISDN>0831610781</MSISDN>
								</NumberNoPortId>
								<NumberNoPortId>
									<MSISDN>0869791067</MSISDN>
								</NumberNoPortId>
								<NumberNoPortId>
									<MSISDN>0895029670</MSISDN>
								</NumberNoPortId>
								<NumberNoPortId>
									<MSISDN>0890739323</MSISDN>
								</NumberNoPortId>
								<NumberNoPortId>
									<MSISDN>0805728353</MSISDN>
								</NumberNoPortId>
								<NumberNoPortId>
									<MSISDN>0881878435</MSISDN>
								</NumberNoPortId>
								<NumberNoPortId>
									<MSISDN>0812664069</MSISDN>
								</NumberNoPortId>
								<NumberNoPortId>
									<MSISDN>0894980507</MSISDN>
								</NumberNoPortId>
								<NumberNoPortId>
									<MSISDN>0984767201</MSISDN>
								</NumberNoPortId>
								<NumberNoPortId>
									<MSISDN>0818882679</MSISDN>
								</NumberNoPortId>
								<NumberNoPortId>
									<MSISDN>0836936655</MSISDN>
								</NumberNoPortId>
								<NumberNoPortId>
									<MSISDN>0813688315</MSISDN>
								</NumberNoPortId>
								<NumberNoPortId>
									<MSISDN>0831517547</MSISDN>
								</NumberNoPortId>
								<NumberNoPortId>
									<MSISDN>0847771797</MSISDN>
								</NumberNoPortId>
								<NumberNoPortId>
									<MSISDN>0900380039</MSISDN>
								</NumberNoPortId>
								<NumberNoPortId>
									<MSISDN>0938867991</MSISDN>
								</NumberNoPortId>
								<NumberNoPortId>
									<MSISDN>0850510200</MSISDN>
								</NumberNoPortId>
								<NumberNoPortId>
									<MSISDN>0816296116</MSISDN>
								</NumberNoPortId>
								<NumberNoPortId>
									<MSISDN>0929145303</MSISDN>
								</NumberNoPortId>
								<NumberNoPortId>
									<MSISDN>0841325682</MSISDN>
								</NumberNoPortId>
							</NumberReturn>
						</NPCMessages>
						<MessageFooter>
							<Checksum>176</Checksum>
						</MessageFooter>
					</NPCData>
				</NPCMessageData>
			</ns:xmlMsg>
		</ns:processNPCMsg>
	</soap:Body>
</soap:Envelope>